/*
Синтаксис
Начало
Определить первое число
Определить второе число
Вывести сумму введенных чисел на экран
Конец
*/

int numberA = 31;
int numberB = 54;
int result = numberA + numberB;
Console.WriteLine(result);